{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_size": [20, 12], "activation": "relu", "trainable": true, "filters": 50, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [1, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 650, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.3, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "softmax", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null}}], "build_input_shape": [null, 20, 100, 1]}, "keras_version": "2.2.4"}