{"class_name": "Sequential", "config": {"build_input_shape": [null, 20, 100, 1], "layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_1", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "filters": 50, "kernel_constraint": null, "kernel_size": [20, 12], "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "pool_size": [1, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "units": 650, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}